<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Info.plist</key>
		<data>
		qqZxvUltVtgfXMxkRbVNZAtejb8=
		</data>
		<key>Resources/alphafont.mlmodelc/analytics/coremldata.bin</key>
		<data>
		MGRhGkBdcpVE+PNB1a09bU6+TmI=
		</data>
		<key>Resources/alphafont.mlmodelc/coremldata.bin</key>
		<data>
		RIdvQ40mLKDfjeFpoPke/pfq0rc=
		</data>
		<key>Resources/alphafont.mlmodelc/metadata.json</key>
		<data>
		Mzm1d9/rS1XQ8XGEKoT8MqrfFaE=
		</data>
		<key>Resources/alphafont.mlmodelc/model.espresso.net</key>
		<data>
		hXdQUkIt9nmXaxEtqalgkNPJTls=
		</data>
		<key>Resources/alphafont.mlmodelc/model.espresso.shape</key>
		<data>
		R3ewtHfiJcre1PdPMkRrElZj2EI=
		</data>
		<key>Resources/alphafont.mlmodelc/model.espresso.weights</key>
		<data>
		DtbU16a/6WpY+PRDiVvp5SFHn5I=
		</data>
		<key>Resources/alphafont.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/alphafont.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/analytics/coremldata.bin</key>
		<data>
		7uQlT4DzmCqYlOn5Vq4Ka87MMnU=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/coremldata.bin</key>
		<data>
		ECgKWlZo9SV4akwIylauTOKlF14=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/metadata.json</key>
		<data>
		mTsOlzWzPLDTreeN6WapuaoTsVk=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/model.espresso.net</key>
		<data>
		YfDKrNEJFKZ86q5+7Br2734KTP0=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/model.espresso.shape</key>
		<data>
		QQG3NQInqJID9t5dErSz4hixJz0=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/model.espresso.weights</key>
		<data>
		FQMQUvaPJnRsqiw9n8DGBzWU3Ac=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/alphafont_raw_input.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Resources/alphafontp.mlmodelc/analytics/coremldata.bin</key>
		<data>
		/tBzQW7nXOPGNfWlQwhjGCt7cSU=
		</data>
		<key>Resources/alphafontp.mlmodelc/coremldata.bin</key>
		<data>
		RIdvQ40mLKDfjeFpoPke/pfq0rc=
		</data>
		<key>Resources/alphafontp.mlmodelc/metadata.json</key>
		<data>
		ECt01QGULY62S2GFEPj47+9U8/E=
		</data>
		<key>Resources/alphafontp.mlmodelc/model.espresso.net</key>
		<data>
		1y1MIc5PR0g64Khds6qBEfwAbCs=
		</data>
		<key>Resources/alphafontp.mlmodelc/model.espresso.shape</key>
		<data>
		9Y22AWgafE9Aev1BW6G4tdp6gxM=
		</data>
		<key>Resources/alphafontp.mlmodelc/model.espresso.weights</key>
		<data>
		ZIiF+gPYY9LOO7oUUcFe2FbkzoY=
		</data>
		<key>Resources/alphafontp.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Resources/alphafontp.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Resources/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			zZmxqA78cqZPxuBZkp6uDJGtqotmG/yv4NwnJMScTwQ=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			AjZnv5jHZ2bGQF71/NWDK+aNRnufhUPqMH4UtgJb1MM=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Pspk8z1sGWIAfgl0op4rV63hO5S2Kez+kCYPUMDoCuI=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			SqIbmFFMWaS5AelxeBxjUhp4zzwhh3ilbNhmKnYSWmM=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			hwZuGX88dIHDAHWOXp+EfMU0u1wiPwTQCujc4tjiB9Y=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			X9wjT4jC17ohWub/RGcp8CL0ctaNPWifVXDGZv27Xys=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			ZNLLkCXgPRtBuCvokHg0RqPVQd8pYwDrfgQurjFMvuU=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/alphafont.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Oncfcjx5BZ9FT6cz/SVE57xz3aZ4NGQWiGQESx0lfFk=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Md7eavLfu8fm+0G0futNwtpQo4a+msoTFowzXrSPR9I=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			f0kWrPFyGcUw5BFYUHohUN27VCcVc7KPsGdutBjXCVg=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			KM8nKNcqkKKgww1eWc+B1pJBwVqlWMReEHEJLZd/tto=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			Z69zTNYNNQygRFyFdKEOSA3Ir4m6L4jq9FoNDDzwwYY=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			yOrD5TSh9IGFyjzFajbBuMWX5R+OU+781NXKlz7VbH4=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/alphafont_raw_input.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			laengPPxoBt1STxnrAOF64ZSQbugIl3L4dF5wh2pyks=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Pspk8z1sGWIAfgl0op4rV63hO5S2Kez+kCYPUMDoCuI=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			deEux7SCGJbEf+TDG48u6tMEwcZ/jXdJtf4l8R60O8Q=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			s1m5NA7gnP0dcQP7Bt1yCai69XbXdsRhNdVD0S1Gkso=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			3UJWVa3P0CHU44M41VoC/yTZ15lYSlJ9ZswUeggVWBs=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			WYzhG7Wx3OJEb74KJIxzeC+8zArld7HSyv2XjftqJ/8=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Resources/alphafontp.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
