{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv11__activation___output",
      "K" : 1,
      "blob_biases" : 1,
      "name" : "conv11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv12__activation___output",
      "K" : 8,
      "blob_biases" : 5,
      "name" : "conv12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "conv11__activation___output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_4_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_4",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "conv12__activation___output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2__activation___output",
      "K" : 8,
      "blob_biases" : 9,
      "name" : "conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "max_pooling2d_4_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_5_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_5",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "conv2__activation___output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv3__activation___output",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "conv3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pooling2d_5_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_6_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_6",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "conv3__activation___output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "max_pooling2d_6_output",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 0,
      "debug_info" : "flatten_2",
      "top" : "flatten_2_output",
      "type" : "flatten",
      "name" : "flatten_2"
    },
    {
      "nB" : 512,
      "top" : "dense_5__activation___output",
      "has_biases" : 1,
      "blob_weights_f16" : 19,
      "nC" : 64,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "flatten_2_output",
      "blob_biases" : 17,
      "has_tanh" : 1,
      "debug_info" : "dense_5",
      "name" : "dense_5",
      "has_prelu" : 0
    },
    {
      "nB" : 64,
      "top" : "dense_6_output",
      "has_biases" : 1,
      "blob_weights_f16" : 23,
      "nC" : 16,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_5__activation___output",
      "blob_biases" : 21,
      "has_tanh" : 0,
      "debug_info" : "dense_6",
      "name" : "dense_6",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_6_output",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "dense_6__activation__",
      "top" : "dense_6__activation___output",
      "type" : "activation",
      "name" : "dense_6__activation__"
    },
    {
      "nB" : 16,
      "top" : "dense_7_output",
      "has_biases" : 1,
      "blob_weights_f16" : 27,
      "nC" : 4,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_6__activation___output",
      "blob_biases" : 25,
      "has_tanh" : 0,
      "debug_info" : "dense_7",
      "name" : "dense_7",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_7_output",
      "attributes" : {
        "is_output" : 1
      },
      "weights" : {

      },
      "debug_info" : "dense_7__activation__",
      "top" : "fontClass",
      "C" : 2,
      "type" : "softmax",
      "name" : "dense_7__activation__"
    },
    {
      "nB" : 16,
      "top" : "dense_8_output",
      "has_biases" : 1,
      "blob_weights_f16" : 31,
      "nC" : 4,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_6__activation___output",
      "blob_biases" : 29,
      "has_tanh" : 0,
      "debug_info" : "dense_8",
      "name" : "dense_8",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_8_output",
      "attributes" : {
        "is_output" : 1
      },
      "weights" : {

      },
      "debug_info" : "dense_8__activation__",
      "top" : "fontStyle",
      "C" : 2,
      "type" : "softmax",
      "name" : "dense_8__activation__"
    }
  ]
}