{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_1__activation___output",
      "K" : 1,
      "blob_biases" : 1,
      "name" : "conv2d_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_1_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_1",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "conv2d_1__activation___output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_2__activation___output",
      "K" : 16,
      "blob_biases" : 5,
      "name" : "conv2d_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "max_pooling2d_1_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_2_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_2",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "conv2d_2__activation___output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_3__activation___output",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "conv2d_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "max_pooling2d_2_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "debug_info" : "max_pooling2d_3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "max_pooling2d_3_output",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "max_pooling2d_3",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "conv2d_3__activation___output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "bottom" : "max_pooling2d_3_output",
      "weights" : {

      },
      "mode" : 1,
      "nd_axis" : 0,
      "debug_info" : "flatten_1",
      "top" : "flatten_1_output",
      "type" : "flatten",
      "name" : "flatten_1"
    },
    {
      "nB" : 1024,
      "top" : "dense_1_output",
      "has_biases" : 1,
      "blob_weights_f16" : 15,
      "nC" : 128,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "flatten_1_output",
      "blob_biases" : 13,
      "has_tanh" : 0,
      "debug_info" : "dense_1",
      "name" : "dense_1",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_1_output",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "dense_1__activation__",
      "top" : "dense_1__activation___output",
      "type" : "activation",
      "name" : "dense_1__activation__"
    },
    {
      "nB" : 128,
      "top" : "dense_2_output",
      "has_biases" : 1,
      "blob_weights_f16" : 19,
      "nC" : 4,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_1__activation___output",
      "blob_biases" : 17,
      "has_tanh" : 0,
      "debug_info" : "dense_2",
      "name" : "dense_2",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_2_output",
      "attributes" : {
        "is_output" : 1
      },
      "weights" : {

      },
      "debug_info" : "dense_2__activation__",
      "top" : "font_class",
      "C" : 2,
      "type" : "softmax",
      "name" : "dense_2__activation__"
    },
    {
      "nB" : 128,
      "top" : "dense_3_output",
      "has_biases" : 1,
      "blob_weights_f16" : 23,
      "nC" : 4,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "dense_1__activation___output",
      "blob_biases" : 21,
      "has_tanh" : 0,
      "debug_info" : "dense_3",
      "name" : "dense_3",
      "has_prelu" : 0
    },
    {
      "bottom" : "dense_3_output",
      "attributes" : {
        "is_output" : 1
      },
      "weights" : {

      },
      "debug_info" : "dense_3__activation__",
      "top" : "font_style",
      "C" : 2,
      "type" : "softmax",
      "name" : "dense_3__activation__"
    }
  ]
}